In [18]:
import pandas as pd
df=pd.read_csv('../../../../../Downloads/sample.csv',encoding='unicode_escape')

In [19]:
df.columns=['column1','column2','column3','column4','column5','column6','column7','column8','column9','column10']
df.head()

,column1,column2,column3,column4,column5,column6,column7,column8,column9,column10
0,2,"1.7 Cubic Foot Compact ""Cube"" Office Refrigera...",Barry French,293,457.81,208.16,68.02,Nunavut,Appliances,0.58
1,3,"Cardinal Slant-D® Ring Binder, Heavy Gauge Vinyl",Barry French,293,46.71,8.69,2.99,Nunavut,Binders and Binder Accessories,0.39
2,4,R380,Clay Rozendal,483,1198.97,195.99,3.99,Nunavut,Telephones and Communication,0.58
3,5,Holmes HEPA Air Purifier,Carlos Soltero,515,30.94,21.78,5.94,Nunavut,Appliances,0.50
4,6,G.E. Longer-Life Indoor Recessed Floodlight Bulbs,Carlos Soltero,515,4.43,6.64,4.95,Nunavut,Office Furnishings,0.37

In [20]:
df.loc[[2,3]]

,column1,column2,column3,column4,column5,column6,column7,column8,column9,column10
2,4,R380,Clay Rozendal,483,1198.97,195.99,3.99,Nunavut,Telephones and Communication,0.58
3,5,Holmes HEPA Air Purifier,Carlos Soltero,515,30.94,21.78,5.94,Nunavut,Appliances,0.50

In [21]:
df.loc[0,'column2']

'1.7 Cubic Foot Compact "Cube" Office Refrigerators'

In [22]:
df.loc[[2,4],'column2']

2                                                 R380
4    G.E. Longer-Life Indoor Recessed Floodlight Bulbs
Name: column2, dtype: object

In [23]:
df.loc[[2,4],['column1','column2']]

   column1                                            column2
2        4                                               R380
4        6  G.E. Longer-Life Indoor Recessed Floodlight Bulbs

In [24]:
df.loc[2:4,['column1','column2']]

   column1                                            column2
2        4                                               R380
3        5                           Holmes HEPA Air Purifier
4        6  G.E. Longer-Life Indoor Recessed Floodlight Bulbs

In [25]:
df.iloc[2,4]

1198.97

In [26]:
df.iloc[0:3,1:3]

                                             column2        column3
0  1.7 Cubic Foot Compact "Cube" Office Refrigera...   Barry French
1   Cardinal Slant-D® Ring Binder, Heavy Gauge Vinyl   Barry French
2                                               R380  Clay Rozendal

In [27]:
df.iloc[[1,3],[2,4]]

          column3  column5
1    Barry French    46.71
3  Carlos Soltero    30.94

In [28]:
py_df=pd.DataFrame({'name':['bibin','shri','varsha','srujan'],'email':['asd@gmail.com','asd@g.com','fsadf@g.com','afsfdas@gmail.com']})
py_df

     name              email
0   bibin      asd@gmail.com
1    shri          asd@g.com
2  varsha        fsadf@g.com
3  srujan  afsfdas@gmail.com

In [29]:
sql_df=pd.DataFrame({'name':['bibin','ziya','srujan','nikhil'],'email':['asd@gmail.com','d@g.com','afsfdas@gmail.com','adadadG.com']})
sql_df

     name              email
0   bibin      asd@gmail.com
1    ziya            d@g.com
2  srujan  afsfdas@gmail.com
3  nikhil        adadadG.com

In [33]:
all=pd.concat([py_df,sql_df]).drop_duplicates()
all

     name              email
0   bibin      asd@gmail.com
1    shri          asd@g.com
2  varsha        fsadf@g.com
3  srujan  afsfdas@gmail.com
1    ziya            d@g.com
3  nikhil        adadadG.com

In [34]:
inter=py_df.merge(sql_df)
inter

     name              email
0   bibin      asd@gmail.com
1  srujan  afsfdas@gmail.com

In [38]:
in_py_not_in_sql=py_df[py_df.name.isin(sql_df.name)==False]
in_py_not_in_sql

     name        email
1    shri    asd@g.com
2  varsha  fsadf@g.com

In [41]:
in_sql_not_in_py=sql_df[sql_df.name.isin(py_df.name)==False]
in_sql_not_in_py

     name        email
1    ziya      d@g.com
3  nikhil  adadadG.com

TypeError: 'function' object is not iterable